albuns_ci/app/Models/MusicaModel.php

SELECT *
FROM `musicas`
WHERE `album_id` = 1
ORDER BY `ordem` ASC
---
    public function musicasDoAlbum(int $albumId)
    {
        return $this->where('album_id', $albumId)
                    ->orderBy('ordem', 'ASC')
                    ->findAll();

DELETE FROM `musicas`
WHERE `album_id` = 1
---
    public function removerDoAlbum(int $albumId): bool
    {
        return $this->where('album_id', $albumId)->delete();

INSERT INTO `musicas` (`album_id`, `nome_musica`, `ordem`) VALUES (1, 'papapa', 1)
---
    public function salvarLista(int $albumId, array $nomes): void
    {
        $this->removerDoAlbum($albumId);

        $ordem = 1;
        foreach ($nomes as $nome) {
            $nome = trim($nome);
            if ($nome === '') {
                continue;
            }
            $this->insert([
                'album_id'    => $albumId,
                'nome_musica' => $nome,
                'ordem'       => $ordem,
            ]);